## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_firewall.fw must be replaced
-/+ resource "azurerm_firewall" "fw" {
      ~ dns_proxy_enabled   = false -> (known after apply)
      - dns_servers         = [] -> null
      ~ firewall_policy_id  = "/subscriptions/05e45818-2478-475f-87d8-4c8cf13455c0/resourceGroups/rg-terraform-github-actions/providers/Microsoft.Network/firewallPolicies/fwpolicy" -> (known after apply)
      ~ id                  = "/subscriptions/05e45818-2478-475f-87d8-4c8cf13455c0/resourceGroups/rg-terraform-github-actions/providers/Microsoft.Network/azureFirewalls/testfirewall" -> (known after apply)
        name                = "testfirewall"
      - private_ip_ranges   = [] -> null
      ~ resource_group_name = "rg-terraform-github-actions" -> "RG_BP_HUB_Vnet_Prod" # forces replacement
      ~ tags                = {
          + "deployment" = "tf"
          + "stage"      = "prod"
        }
      ~ threat_intel_mode   = "Alert" -> (known after apply)
        # (4 unchanged attributes hidden)

      ~ ip_configuration {
            name                 = "configuration"
          ~ private_ip_address   = "10.0.2.4" -> (known after apply)
          ~ public_ip_address_id = "/subscriptions/05e45818-2478-475f-87d8-4c8cf13455c0/resourceGroups/rg-terraform-github-actions/providers/Microsoft.Network/publicIPAddresses/fwpip" -> (known after apply)
          ~ subnet_id            = "/subscriptions/05e45818-2478-475f-87d8-4c8cf13455c0/resourceGroups/rg-terraform-github-actions/providers/Microsoft.Network/virtualNetworks/VNET-Hub/subnets/AzureFirewallSubnet" -> (known after apply) # forces replacement
        }
    }

  # azurerm_firewall_policy.fwpolicy must be replaced
-/+ resource "azurerm_firewall_policy" "fwpolicy" {
      - auto_learn_private_ranges_enabled = false -> null
      ~ child_policies                    = [] -> (known after apply)
      ~ firewalls                         = [
          - "/subscriptions/05e45818-2478-475f-87d8-4c8cf13455c0/resourceGroups/rg-terraform-github-actions/providers/Microsoft.Network/azureFirewalls/testfirewall",
        ] -> (known after apply)
      ~ id                                = "/subscriptions/05e45818-2478-475f-87d8-4c8cf13455c0/resourceGroups/rg-terraform-github-actions/providers/Microsoft.Network/firewallPolicies/fwpolicy" -> (known after apply)
        name                              = "fwpolicy"
      - private_ip_ranges                 = [] -> null
      ~ resource_group_name               = "rg-terraform-github-actions" -> "RG_BP_HUB_Vnet_Prod" # forces replacement
      ~ rule_collection_groups            = [] -> (known after apply)
      - tags                              = {} -> null
        # (4 unchanged attributes hidden)
    }

  # azurerm_network_security_group.fw-subnet-nsg must be replaced
-/+ resource "azurerm_network_security_group" "fw-subnet-nsg" {
      ~ id                  = "/subscriptions/05e45818-2478-475f-87d8-4c8cf13455c0/resourceGroups/rg-terraform-github-actions/providers/Microsoft.Network/networkSecurityGroups/nsg-fw-subnet" -> (known after apply)
        name                = "nsg-fw-subnet"
      ~ resource_group_name = "rg-terraform-github-actions" -> "RG_BP_HUB_Vnet_Prod" # forces replacement
      ~ security_rule       = [
          - {
              - access                                     = "Allow"
              - description                                = "Allow all for test"
              - destination_address_prefix                 = "*"
              - destination_address_prefixes               = []
              - destination_application_security_group_ids = []
              - destination_port_range                     = "*"
              - destination_port_ranges                    = []
              - direction                                  = "Outbound"
              - name                                       = "rule1"
              - priority                                   = 100
              - protocol                                   = "*"
              - source_address_prefix                      = "*"
              - source_address_prefixes                    = []
              - source_application_security_group_ids      = []
              - source_port_range                          = "*"
              - source_port_ranges                         = []
            },
        ] -> (known after apply)
      - tags                = {} -> null
        # (1 unchanged attribute hidden)
    }

  # azurerm_network_security_group.gw-subnet-nsg must be replaced
-/+ resource "azurerm_network_security_group" "gw-subnet-nsg" {
      ~ id                  = "/subscriptions/05e45818-2478-475f-87d8-4c8cf13455c0/resourceGroups/rg-terraform-github-actions/providers/Microsoft.Network/networkSecurityGroups/nsg-gw-subnet" -> (known after apply)
        name                = "nsg-gw-subnet"
      ~ resource_group_name = "rg-terraform-github-actions" -> "RG_BP_HUB_Vnet_Prod" # forces replacement
      ~ security_rule       = [
          - {
              - access                                     = "Allow"
              - description                                = "Allow all for test"
              - destination_address_prefix                 = "*"
              - destination_address_prefixes               = []
              - destination_application_security_group_ids = []
              - destination_port_range                     = "*"
              - destination_port_ranges                    = []
              - direction                                  = "Outbound"
              - name                                       = "rule1"
              - priority                                   = 100
              - protocol                                   = "*"
              - source_address_prefix                      = "*"
              - source_address_prefixes                    = []
              - source_application_security_group_ids      = []
              - source_port_range                          = "*"
              - source_port_ranges                         = []
            },
        ] -> (known after apply)
      - tags                = {} -> null
        # (1 unchanged attribute hidden)
    }

  # azurerm_network_security_rule.rule-1-fw must be replaced
-/+ resource "azurerm_network_security_rule" "rule-1-fw" {
      - destination_address_prefixes               = [] -> null
      - destination_application_security_group_ids = [] -> null
      - destination_port_ranges                    = [] -> null
      ~ id                                         = "/subscriptions/05e45818-2478-475f-87d8-4c8cf13455c0/resourceGroups/rg-terraform-github-actions/providers/Microsoft.Network/networkSecurityGroups/nsg-fw-subnet/securityRules/rule1" -> (known after apply)
        name                                       = "rule1"
      ~ resource_group_name                        = "rg-terraform-github-actions" -> "RG_BP_HUB_Vnet_Prod" # forces replacement
      - source_address_prefixes                    = [] -> null
      - source_application_security_group_ids      = [] -> null
      - source_port_ranges                         = [] -> null
        # (10 unchanged attributes hidden)
    }

  # azurerm_network_security_rule.rule-1-gw must be replaced
-/+ resource "azurerm_network_security_rule" "rule-1-gw" {
      - destination_address_prefixes               = [] -> null
      - destination_application_security_group_ids = [] -> null
      - destination_port_ranges                    = [] -> null
      ~ id                                         = "/subscriptions/05e45818-2478-475f-87d8-4c8cf13455c0/resourceGroups/rg-terraform-github-actions/providers/Microsoft.Network/networkSecurityGroups/nsg-gw-subnet/securityRules/rule1" -> (known after apply)
        name                                       = "rule1"
      ~ resource_group_name                        = "rg-terraform-github-actions" -> "RG_BP_HUB_Vnet_Prod" # forces replacement
      - source_address_prefixes                    = [] -> null
      - source_application_security_group_ids      = [] -> null
      - source_port_ranges                         = [] -> null
        # (10 unchanged attributes hidden)
    }

  # azurerm_public_ip.fwpubip must be replaced
-/+ resource "azurerm_public_ip" "fwpubip" {
      + fqdn                    = (known after apply)
      ~ id                      = "/subscriptions/05e45818-2478-475f-87d8-4c8cf13455c0/resourceGroups/rg-terraform-github-actions/providers/Microsoft.Network/publicIPAddresses/fwpip" -> (known after apply)
      ~ ip_address              = "135.236.233.131" -> (known after apply)
      - ip_tags                 = {} -> null
        name                    = "fwpip"
      ~ resource_group_name     = "rg-terraform-github-actions" -> "RG_BP_HUB_Vnet_Prod" # forces replacement
      ~ tags                    = {
          + "deployment" = "tf"
          + "stage"      = "prod"
        }
        # (9 unchanged attributes hidden)
    }

  # azurerm_public_ip.vpnpubip must be replaced
-/+ resource "azurerm_public_ip" "vpnpubip" {
      + fqdn                    = (known after apply)
      ~ id                      = "/subscriptions/05e45818-2478-475f-87d8-4c8cf13455c0/resourceGroups/rg-terraform-github-actions/providers/Microsoft.Network/publicIPAddresses/vpnpubip" -> (known after apply)
      ~ ip_address              = "135.236.233.124" -> (known after apply)
      - ip_tags                 = {} -> null
        name                    = "vpnpubip"
      ~ resource_group_name     = "rg-terraform-github-actions" -> "RG_BP_HUB_Vnet_Prod" # forces replacement
      ~ tags                    = {
          + "deployment" = "tf"
          + "stage"      = "prod"
        }
        # (9 unchanged attributes hidden)
    }

  # azurerm_resource_group.rghubnetworking must be replaced
-/+ resource "azurerm_resource_group" "rghubnetworking" {
      ~ id         = "/subscriptions/05e45818-2478-475f-87d8-4c8cf13455c0/resourceGroups/rg-terraform-github-actions" -> (known after apply)
      ~ name       = "rg-terraform-github-actions" -> "RG_BP_HUB_Vnet_Prod" # forces replacement
      ~ tags       = {
          + "deployment" = "tf"
          + "stage"      = "prod"
        }
        # (2 unchanged attributes hidden)
    }

  # azurerm_subnet.firewallsubnet must be replaced
-/+ resource "azurerm_subnet" "firewallsubnet" {
      ~ id                                            = "/subscriptions/05e45818-2478-475f-87d8-4c8cf13455c0/resourceGroups/rg-terraform-github-actions/providers/Microsoft.Network/virtualNetworks/VNET-Hub/subnets/AzureFirewallSubnet" -> (known after apply)
        name                                          = "AzureFirewallSubnet"
      ~ resource_group_name                           = "rg-terraform-github-actions" -> "RG_BP_HUB_Vnet_Prod" # forces replacement
      - service_endpoint_policy_ids                   = [] -> null
      - service_endpoints                             = [] -> null
        # (5 unchanged attributes hidden)
    }

  # azurerm_subnet.gatewaysubnet must be replaced
-/+ resource "azurerm_subnet" "gatewaysubnet" {
      ~ id                                            = "/subscriptions/05e45818-2478-475f-87d8-4c8cf13455c0/resourceGroups/rg-terraform-github-actions/providers/Microsoft.Network/virtualNetworks/VNET-Hub/subnets/GatewaySubnet" -> (known after apply)
        name                                          = "GatewaySubnet"
      ~ resource_group_name                           = "rg-terraform-github-actions" -> "RG_BP_HUB_Vnet_Prod" # forces replacement
      - service_endpoint_policy_ids                   = [] -> null
      - service_endpoints                             = [] -> null
        # (5 unchanged attributes hidden)
    }

  # azurerm_virtual_network.vnet must be replaced
-/+ resource "azurerm_virtual_network" "vnet" {
      ~ dns_servers             = [] -> (known after apply)
      - flow_timeout_in_minutes = 0 -> null
      ~ guid                    = "64fcaafd-1a6a-45b8-bcb2-cba0d99f4b1f" -> (known after apply)
      ~ id                      = "/subscriptions/05e45818-2478-475f-87d8-4c8cf13455c0/resourceGroups/rg-terraform-github-actions/providers/Microsoft.Network/virtualNetworks/VNET-Hub" -> (known after apply)
        name                    = "VNET-Hub"
      ~ resource_group_name     = "rg-terraform-github-actions" -> "RG_BP_HUB_Vnet_Prod" # forces replacement
      ~ subnet                  = [
          - {
              - address_prefixes                              = [
                  - "10.0.1.0/24",
                ]
              - default_outbound_access_enabled               = true
              - delegation                                    = []
              - id                                            = "/subscriptions/05e45818-2478-475f-87d8-4c8cf13455c0/resourceGroups/rg-terraform-github-actions/providers/Microsoft.Network/virtualNetworks/VNET-Hub/subnets/GatewaySubnet"
              - name                                          = "GatewaySubnet"
              - private_endpoint_network_policies             = "Disabled"
              - private_link_service_network_policies_enabled = true
              - service_endpoint_policy_ids                   = []
              - service_endpoints                             = []
                # (2 unchanged attributes hidden)
            },
          - {
              - address_prefixes                              = [
                  - "10.0.2.0/24",
                ]
              - default_outbound_access_enabled               = true
              - delegation                                    = []
              - id                                            = "/subscriptions/05e45818-2478-475f-87d8-4c8cf13455c0/resourceGroups/rg-terraform-github-actions/providers/Microsoft.Network/virtualNetworks/VNET-Hub/subnets/AzureFirewallSubnet"
              - name                                          = "AzureFirewallSubnet"
              - private_endpoint_network_policies             = "Disabled"
              - private_link_service_network_policies_enabled = true
              - service_endpoint_policy_ids                   = []
              - service_endpoints                             = []
                # (2 unchanged attributes hidden)
            },
        ] -> (known after apply)
      ~ tags                    = {
            "deployment" = "tf"
          + "stage"      = "prod"
        }
        # (4 unchanged attributes hidden)
    }

  # azurerm_virtual_network_gateway.vpngw must be replaced
-/+ resource "azurerm_virtual_network_gateway" "vpngw" {
      - dns_forwarding_enabled                = false -> null
      ~ generation                            = "Generation1" -> (known after apply)
      ~ id                                    = "/subscriptions/05e45818-2478-475f-87d8-4c8cf13455c0/resourceGroups/rg-terraform-github-actions/providers/Microsoft.Network/virtualNetworkGateways/VPN-GW-1" -> (known after apply)
        name                                  = "VPN-GW-1"
      - private_ip_address_enabled            = false -> null
      ~ resource_group_name                   = "rg-terraform-github-actions" -> "RG_BP_HUB_Vnet_Prod" # forces replacement
      ~ tags                                  = {
          + "deployment" = "tf"
          + "stage"      = "prod"
        }
        # (11 unchanged attributes hidden)

      ~ bgp_settings (known after apply)
      - bgp_settings {
          - asn         = 65515 -> null
          - peer_weight = 0 -> null

          - peering_addresses {
              - apipa_addresses       = [] -> null
              - default_addresses     = [
                  - "10.0.1.254",
                ] -> null
              - ip_configuration_name = "vnetGatewayConfig" -> null
              - tunnel_ip_addresses   = [
                  - "135.236.233.124",
                ] -> null
            }
        }

      ~ ip_configuration {
            name                          = "vnetGatewayConfig"
          ~ public_ip_address_id          = "/subscriptions/05e45818-2478-475f-87d8-4c8cf13455c0/resourceGroups/rg-terraform-github-actions/providers/Microsoft.Network/publicIPAddresses/vpnpubip" -> (known after apply)
          ~ subnet_id                     = "/subscriptions/05e45818-2478-475f-87d8-4c8cf13455c0/resourceGroups/rg-terraform-github-actions/providers/Microsoft.Network/virtualNetworks/VNET-Hub/subnets/GatewaySubnet" -> (known after apply)
            # (1 unchanged attribute hidden)
        }

      ~ vpn_client_configuration {
          ~ vpn_auth_types        = [
              - "Certificate",
            ] -> (known after apply)
          ~ vpn_client_protocols  = [
              - "IkeV2",
              - "OpenVPN",
            ] -> (known after apply)
            # (6 unchanged attributes hidden)

          - root_certificate {
              - name             = "DigiCert-Federated-ID-Root-CA" -> null
              - public_cert_data = <<-EOT
                    MIIDuzCCAqOgAwIBAgIQCHTZWCM+IlfFIRXIvyKSrjANBgkqhkiG9w0BAQsFADBn
                    MQswCQYDVQQGEwJVUzEVMBMGA1UEChMMRGlnaUNlcnQgSW5jMRkwFwYDVQQLExB3
                    d3cuZGlnaWNlcnQuY29tMSYwJAYDVQQDEx1EaWdpQ2VydCBGZWRlcmF0ZWQgSUQg
                    Um9vdCBDQTAeFw0xMzAxMTUxMjAwMDBaFw0zMzAxMTUxMjAwMDBaMGcxCzAJBgNV
                    BAYTAlVTMRUwEwYDVQQKEwxEaWdpQ2VydCBJbmMxGTAXBgNVBAsTEHd3dy5kaWdp
                    Y2VydC5jb20xJjAkBgNVBAMTHURpZ2lDZXJ0IEZlZGVyYXRlZCBJRCBSb290IENB
                    MIIBIjANBgkqhkiG9w0BAQEFAAOCAQ8AMIIBCgKCAQEAvAEB4pcCqnNNOWE6Ur5j
                    QPUH+1y1F9KdHTRSza6k5iDlXq1kGS1qAkuKtw9JsiNRrjltmFnzMZRBbX8Tlfl8
                    zAhBmb6dDduDGED01kBsTkgywYPxXVTKec0WxYEEF0oMn4wSYNl0lt2eJAKHXjNf
                    GTwiibdP8CUR2ghSM2sUTI8Nt1Omfc4SMHhGhYD64uJMbX98THQ/4LMGuYegou+d
                    GTiahfHtjn7AboSEknwAMJHCh5RlYZZ6B1O4QbKJ+34Q0eKgnI3X6Vc9u0zf6DH8
                    Dk+4zQDYRRTqTnVO3VT8jzqDlCRuNtq6YvryOWN74/dq8LQhUnXHvFyrsdMaE1X2
                    DwIDAQABo2MwYTAPBgNVHRMBAf8EBTADAQH/MA4GA1UdDwEB/wQEAwIBhjAdBgNV
                    HQ4EFgQUGRdkFnbGt1EWjKwbUne+5OaZvRYwHwYDVR0jBBgwFoAUGRdkFnbGt1EW
                    jKwbUne+5OaZvRYwDQYJKoZIhvcNAQELBQADggEBAHcqsHkrjpESqfuVTRiptJfP
                    9JbdtWqRTmOf6uJi2c8YVqI6XlKXsD8C1dUUaaHKLUJzvKiazibVuBwMIT84AyqR
                    QELn3e0BtgEymEygMU569b01ZPxoFSnNXc7qDZBDef8WfqAV/sxkTi8L9BkmFYfL
                    uGLOhRJOFprPdoDIUBB+tmCl3oDcBy3vnUeOEioz8zAkprcb3GHwHAK+vHmmfgcn
                    WsfMLH4JCLa/tRYL+Rw/N3ybCkDp00s0WUZ+AoDywSl0Q/ZEnNY0MsFiw6LyIdbq
                    M/s/1JRtO3bDSzD9TazRVzn2oBqzSa8VgIo5C1nOnoAKJTlsClJKvIhnRlaLQqk=
                EOT -> null
            }
          + root_certificate {
              + name             = "DigiCert-Federated-ID-Root-CA"
              + public_cert_data = <<-EOT
                    MIIDuzCCAqOgAwIBAgIQCHTZWCM+IlfFIRXIvyKSrjANBgkqhkiG9w0BAQsFADBn
                        MQswCQYDVQQGEwJVUzEVMBMGA1UEChMMRGlnaUNlcnQgSW5jMRkwFwYDVQQLExB3
                        d3cuZGlnaWNlcnQuY29tMSYwJAYDVQQDEx1EaWdpQ2VydCBGZWRlcmF0ZWQgSUQg
                        Um9vdCBDQTAeFw0xMzAxMTUxMjAwMDBaFw0zMzAxMTUxMjAwMDBaMGcxCzAJBgNV
                        BAYTAlVTMRUwEwYDVQQKEwxEaWdpQ2VydCBJbmMxGTAXBgNVBAsTEHd3dy5kaWdp
                        Y2VydC5jb20xJjAkBgNVBAMTHURpZ2lDZXJ0IEZlZGVyYXRlZCBJRCBSb290IENB
                        MIIBIjANBgkqhkiG9w0BAQEFAAOCAQ8AMIIBCgKCAQEAvAEB4pcCqnNNOWE6Ur5j
                        QPUH+1y1F9KdHTRSza6k5iDlXq1kGS1qAkuKtw9JsiNRrjltmFnzMZRBbX8Tlfl8
                        zAhBmb6dDduDGED01kBsTkgywYPxXVTKec0WxYEEF0oMn4wSYNl0lt2eJAKHXjNf
                        GTwiibdP8CUR2ghSM2sUTI8Nt1Omfc4SMHhGhYD64uJMbX98THQ/4LMGuYegou+d
                        GTiahfHtjn7AboSEknwAMJHCh5RlYZZ6B1O4QbKJ+34Q0eKgnI3X6Vc9u0zf6DH8
                        Dk+4zQDYRRTqTnVO3VT8jzqDlCRuNtq6YvryOWN74/dq8LQhUnXHvFyrsdMaE1X2
                        DwIDAQABo2MwYTAPBgNVHRMBAf8EBTADAQH/MA4GA1UdDwEB/wQEAwIBhjAdBgNV
                        HQ4EFgQUGRdkFnbGt1EWjKwbUne+5OaZvRYwHwYDVR0jBBgwFoAUGRdkFnbGt1EW
                        jKwbUne+5OaZvRYwDQYJKoZIhvcNAQELBQADggEBAHcqsHkrjpESqfuVTRiptJfP
                        9JbdtWqRTmOf6uJi2c8YVqI6XlKXsD8C1dUUaaHKLUJzvKiazibVuBwMIT84AyqR
                        QELn3e0BtgEymEygMU569b01ZPxoFSnNXc7qDZBDef8WfqAV/sxkTi8L9BkmFYfL
                        uGLOhRJOFprPdoDIUBB+tmCl3oDcBy3vnUeOEioz8zAkprcb3GHwHAK+vHmmfgcn
                        WsfMLH4JCLa/tRYL+Rw/N3ybCkDp00s0WUZ+AoDywSl0Q/ZEnNY0MsFiw6LyIdbq
                        M/s/1JRtO3bDSzD9TazRVzn2oBqzSa8VgIo5C1nOnoAKJTlsClJKvIhnRlaLQqk=
                EOT
            }

            # (1 unchanged block hidden)
        }
    }

Plan: 13 to add, 0 to change, 13 to destroy.
```
</details>